ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "afgadfhsfgh"], ["updated_at", "2018-09-12 00:30:44.500505"], ["id", 1]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)